usr/man/man/usr/share/man/man5/Intro.5
'\" te
.\" Copyright 1989 AT&T  
.\" Copyright (c) 2008, 2010, Oracle and/or its affiliates. All rights reserved.
.TH Intro 5 "17 Nov 2008" "SunOS 5.11" "Standards, Environments, and Macros"
.SH NAME
Intro, intro \- introduction to miscellany
.SH DESCRIPTION
.sp
.LP
Among the topics presented in this section are:
.sp
.ne 2
.mk
.na
\fBStandards\fR
.ad
.RS 16n
.rt  
The POSIX (IEEE) Standards and the X/Open Specifications are described on the \fBstandards\fR page. 
.RE

.sp
.ne 2
.mk
.na
\fBEnvironments\fR
.ad
.RS 16n
.rt  
The user environment (\fBenviron\fR), the subset of the user environment that depends on language and cultural conventions (\fBlocale\fR), the large file compilation environment (\fBlfcompile\fR), and the transitional compilation environment (\fBlfcompile64\fR) are described.
.RE

.sp
.ne 2
.mk
.na
\fBMacros\fR
.ad
.RS 16n
.rt  
The macros to format Reference Manual pages (\fBman\fR and \fBmansun\fR) as well as other text format macros (\fBme\fR, \fBmm\fR, and \fBms\fR) are described.
.RE

.sp
.ne 2
.mk
.na
\fBCharacters\fR
.ad
.RS 16n
.rt  
Tables of character sets (\fBascii\fR, \fBcharmap\fR, \fBeqnchar\fR, and \fBiconv\fR), file format notation (\fBformats\fR), file name pattern matching (\fBfnmatch\fR), and regular expressions (\fBregex\fR and \fBregexp\fR) are presented.
.RE

.SH ACKNOWLEDGMENTS
.sp
.LP
Oracle America, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/\&.
.sp
.LP
The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation.
.sp
.LP
In the following statement, the phrase ``this text'' refers to portions of the system documentation.
.sp
.LP
Portions of this text are reprinted and reproduced in electronic form in the SunOS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group.  In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document.  The original Standard can be obtained online at http://www.opengroup.org/unix/online.html\&.
.sp
.LP
This notice shall appear on any product containing this material.
