usr/man/man/usr/share/man/man1m/Intro.1m
'\" te
.\" Copyright (c) 2008, 2010, Oracle and/or its affiliates. All rights reserved.
.\" Copyright 1989 AT&T
.TH Intro 1M "13 Sep 2010" "SunOS 5.11" "System Administration Commands"
.SH NAME
Intro, intro \- introduction to maintenance commands and application programs
.SH DESCRIPTION
.sp
.LP
This section describes, in alphabetical order, commands that are used chiefly for system maintenance and administration purposes.
.sp
.LP
Because of command restructuring for the Virtual File System architecture, there are several instances of multiple manual pages that begin with the same name. For example, the \fBmount\fR, pages \(mi \fBmount\fR(1M), \fBmount_hsfs\fR(1M), \fBmount_nfs\fR(1M), \fB mount_tmpfs\fR(1M), and \fBmount_ufs\fR(1M). In each such case the first of the multiple pages describes the syntax and options of the generic command, that is, those options applicable to all FSTypes (file system types). The succeeding pages describe the functionality of the FSType-specific modules of the command. These pages list the command followed by an underscore ( _ ) and the FSType to which they pertain. Note that the administrator should not attempt to call these modules directly. The generic command provides a common interface to all of them. Thus the FSType-specific manual pages should not be viewed as describing distinct commands, but rather as detailing those aspects of a command that are specific to a particular FSType.
.SH COMMAND SYNTAX
.sp
.LP
Unless otherwise noted, commands described in this section accept options and other arguments according to the following syntax:
.sp
.in +2
.nf
\fIname\fR [\fIoption\fR(\fIs\fR)] [\fIcmdarg\fR(\fIs\fR)]
.fi
.in -2

.sp
.LP
where:
.sp
.ne 2
.mk
.na
\fB\fIname\fR\fR
.ad
.RS 15n
.rt  
The name of an executable file.
.RE

.sp
.ne 2
.mk
.na
\fB\fIoption\fR\fR
.ad
.RS 15n
.rt  
\fB\(mi\fR \fInoargletter\fR(\fIs\fR) or,
.sp
\fB\(mi\fR \fIargletter\fR<\|>\fIoptarg\fR
.sp
where <\|> is optional white space.
.RE

.sp
.ne 2
.mk
.na
\fB\fInoargletter\fR\fR
.ad
.RS 15n
.rt  
A single letter representing an option without an argument.
.RE

.sp
.ne 2
.mk
.na
\fB\fIargletter\fR\fR
.ad
.RS 15n
.rt  
A single letter representing an option requiring an argument.
.RE

.sp
.ne 2
.mk
.na
\fB\fIoptarg\fR\fR
.ad
.RS 15n
.rt  
Argument (character string) satisfying preceding \fIargletter\fR.
.RE

.sp
.ne 2
.mk
.na
\fB\fIcmdarg\fR\fR
.ad
.RS 15n
.rt  
Pathname (or other command argument) \fInot\fR beginning with \fB\(mi\fR or, \fB\(mi\fR by itself indicating the standard input.
.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for a discussion of the attributes listed in this section.
.SH ACKNOWLEDGMENTS
.sp
.LP
Oracle America, Inc. gratefully acknowledges The Open Group for permission to reproduce portions of its copyrighted documentation. Original documentation from The Open Group can be obtained online at http://www.opengroup.org/bookstore/\&.
.sp
.LP
The Institute of Electrical and Electronics Engineers and The Open Group, have given us permission to reprint portions of their documentation.
.sp
.LP
In the following statement, the phrase ``this text'' refers to portions of the system documentation.
.sp
.LP
Portions of this text are reprinted and reproduced in electronic form in the SunOS Reference Manual, from IEEE Std 1003.1, 2004 Edition, Standard for Information Technology -- Portable Operating System Interface (POSIX), The Open Group Base Specifications Issue 6, Copyright (C) 2001-2004 by the Institute of Electrical and Electronics Engineers, Inc and The Open Group. In the event of any discrepancy between these versions and the original IEEE and The Open Group Standard, the original IEEE and The Open Group Standard is the referee document. The original Standard can be obtained online at http://www.opengroup.org/unix/online.html\&.
.sp
.LP
This notice shall appear on any product containing this material.
.SH SEE ALSO
.sp
.LP
\fBgetopt\fR(1), \fBgetopt\fR(3C), \fBattributes\fR(5)
.SH DIAGNOSTICS
.sp
.LP
Upon termination, each command returns 0 for normal termination and non-zero to indicate troubles such as erroneous parameters, bad or inaccessible data, or other inability to cope with the task at hand. It is called variously ``exit code,'' ``exit status,'' or ``return code,'' and is described only where special conventions are involved.
.SH NOTES
.sp
.LP
Unfortunately, not all commands adhere to the standard syntax.
