usr/man/man/usr/share/man/man1m/Uutry.1m
'\" te
.\"  Copyright 1989 AT&T  Copyright (c) 1997 Sun Microsystems, Inc.  All Rights Reserved.
.TH Uutry 1M "18 May 1993" "SunOS 5.11" "System Administration Commands"
.SH NAME
Uutry, uutry \- attempt to contact remote system with debugging on
.SH SYNOPSIS
.LP
.nf
\fB/usr/lib/uucp/Uutry\fR [\fB-r\fR] [\fB-c\fR \fItype\fR] [\fB-x\fR \fIdebug-level\fR] \fIsystem-name\fR
.fi

.SH DESCRIPTION
.sp
.LP
\fBUutry\fR is a shell script that is used to invoke \fBuucico\fR(1M) to call a remote site. Debugging is initially turned on and is set to the default value of \fB5\fR. The debugging output is put in file \fB/tmp/\fR\fIsystem-name.\fR 
.SH OPTIONS
.sp
.LP
The following options are supported:
.sp
.ne 2
.mk
.na
\fB\fB-r\fR \fR
.ad
.RS 19n
.rt  
This option overrides the retry time that is set in file \fB/var/uucp/.Status/\fR\fIsystem-name.\fR 
.RE

.sp
.ne 2
.mk
.na
\fB\fB-c\fR\fI type\fR \fR
.ad
.RS 19n
.rt  
The first field in the \fBDevices\fR file is the "Type" field.  The \fB-c\fR option forces \fBuucico\fR to use only entries in the "Type" field that  match the user-specified \fBtype\fR. The specified \fBtype\fR is usually the name of a local area network.
.RE

.sp
.ne 2
.mk
.na
\fB\fB-x\fR\fI debug-level\fR \fR
.ad
.RS 19n
.rt  
\fIdebug-level\fR is a number from \fB0\fR to \fB9\fR.  Higher numbers give more detailed debugging information.
.RE

.SH FILES
.sp
.ne 2
.mk
.na
\fB\fB/etc/uucp/Devices\fR \fR
.ad
.RS 28n
.rt  

.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/uucp/Limits\fR \fR
.ad
.RS 28n
.rt  

.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/uucp/Permissions\fR \fR
.ad
.RS 28n
.rt  

.RE

.sp
.ne 2
.mk
.na
\fB\fB/etc/uucp/Systems\fR \fR
.ad
.RS 28n
.rt  

.RE

.sp
.ne 2
.mk
.na
\fB\fB/tmp/\fR\fIsystem-name\fR \fR
.ad
.RS 28n
.rt  

.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/spool/locks/*\fR \fR
.ad
.RS 28n
.rt  

.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/spool/uucp/*\fR \fR
.ad
.RS 28n
.rt  

.RE

.sp
.ne 2
.mk
.na
\fB\fB/var/spool/uucppublic/*\fR \fR
.ad
.RS 28n
.rt  

.RE

.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.sp

.sp
.TS
tab() box;
lw(2.75i) lw(2.75i) 
lw(2.75i) lw(2.75i) 
.
\fBATTRIBUTE TYPE\fR\fBATTRIBUTE VALUE\fR
Availabilityservice/network/uucp
.TE

.SH SEE ALSO
.sp
.LP
\fBuucp\fR(1C), \fBuux\fR(1C), \fBuucico\fR(1M), \fBattributes\fR(5) 
