usr/man/man/usr/share/man/man1b/mail.1b
'\" te
.\" Copyright (c) 1998, Sun Microsystems, Inc.  All Rights Reserved
.TH mail 1B "19 Aug 1998" "SunOS 5.11" "SunOS/BSD Compatibility Package Commands"
.SH NAME
mail, Mail \- interactive message processing system
.SH SYNOPSIS
.LP
.nf
\fB/usr/ucb/mail\fR ...
.fi

.LP
.nf
\fB/usr/ucb/Mail\fR ...
.fi

.SH DESCRIPTION
.sp
.LP
\fB/usr/ucb/mail\fR and \fB/usr/ucb/Mail\fR are provided as links to \fB/usr/bin/mailx.\fR See \fBmailx\fR(1) for more information on the usage of these commands.
.SH ATTRIBUTES
.sp
.LP
See \fBattributes\fR(5) for descriptions of the following attributes:
.SS "\fB/usr/ucb/mail\fR"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitycompatibility/ucb
.TE

.SS "\fB/usr/ucb/Mail\fR"
.sp

.sp
.TS
tab() box;
cw(2.75i) |cw(2.75i) 
lw(2.75i) |lw(2.75i) 
.
ATTRIBUTE TYPEATTRIBUTE VALUE
_
Availabilitycompatibility/ucb
.TE

.SH SEE ALSO
.sp
.LP
\fBmailx\fR(1),\fBattributes\fR(5)
