usr/man/man/usr/share/man/man4/TIMEZONE.4
'\" te
.\" Copyright (c) 2003, Sun Microsystems, Inc. All Rights Reserved.
.\" Copyright 1989 AT&T
.TH TIMEZONE 4 "26 Jun 2003" "SunOS 5.11" "File Formats"
.SH NAME
TIMEZONE \- set default system time zone and locale
.SH SYNOPSIS
.LP
.nf
\fB/etc/TIMEZONE\fR 
\fB/etc/default/init\fR 
.fi

.SH DESCRIPTION
.sp
.LP
This file sets the time zone environment variable \fBTZ\fR, and the locale-related environment variables \fBLANG\fR, \fBLC_COLLATE\fR, \fBLC_CTYPE\fR, \fBLC_MESSAGES\fR, \fBLC_MONETARY\fR, \fBLC_NUMERIC\fR, and \fBLC_TIME\fR. 
.sp
.LP
\fB/etc/TIMEZONE\fR is a symbolic link to \fB/etc/default/init\fR. 
.sp
.LP
The number of environment variables that can be set from \fB/etc/default/init\fR is limited to 20.
.sp
.LP
The format of the file is:
.sp
.in +2
.nf
\fIVAR\fR\fB=\fR\fIvalue\fR
.fi
.in -2
.sp

.sp
.LP
where \fIVAR\fR is a timezone environment variable and \fIvalue\fR is the value assigned to the variable. \fIvalue\fR can be enclosed in double quotes (") or single quotes (\&'). The double or single quotes cannot be part of the value. 
.SH SEE ALSO
.sp
.LP
\fBinit\fR(1M), \fBrtc\fR(1M), \fBctime\fR(3C), \fBenviron\fR(5) 
.SH NOTES
.sp
.LP
When changing the \fBTZ\fR setting on x86 systems, you must make a corresponding change to the \fB/etc/rtc_config\fR file to account for the new timezone setting. This can be accomplished by executing the following commands, followed by a reboot, to make the changes take effect:
.sp
.in +2
.nf
# rtc \fB-z\fR \fIzone-name\fR
# rtc \fB-c\fR
 
.fi
.in -2
.sp

.sp
.LP
where \fIzone-name\fR is the same name as the \fBTZ\fR variable setting. 
.sp
.LP
See \fBrtc\fR(1M) for information on the \fBrtc\fR command.
